toasterllc/MDCCode/Code/STM32/Shared/GPIO.h
//#define GPIOPort(name, addr)                            \
//    extern "C" GPIO_TypeDef name;                       \
//    __asm__(                                            \
//        ".global " #name                        "\n"    \
//        ".equ    " #name ", " Stringify(addr)   "\n"    \
//    )
//
//GPIOPort(GPIOPortA, GPIOA_BASE);
//GPIOPort(GPIOPortB, GPIOB_BASE);
//GPIOPort(GPIOPortC, GPIOC_BASE);
//GPIOPort(GPIOPortD, GPIOD_BASE);
//GPIOPort(GPIOPortE, GPIOE_BASE);
//GPIOPort(GPIOPortF, GPIOF_BASE);
//GPIOPort(GPIOPortG, GPIOG_BASE);
//GPIOPort(GPIOPortH, GPIOH_BASE);
//GPIOPort(GPIOPortI, GPIOI_BASE);






#pragma once
#include "Toastbox/Scheduler.h"
#include "stm32f7xx.h"
#include "Util.h"

namespace GPIO {

enum class Option : uint8_t {
    // Mode
    Input,
    Output0,
    Output1,
    Analog,
    
    // Special options
    OpenDrain,
    
    // Speed
    Speed0,     // Low
    Speed1,     // Medium
    Speed2,     // High
    Speed3,     // Very high
    
    // Pullup/pulldown resistor
    Resistor0,
    Resistor1,
    
    // Interrupts
    IntEn,
    IntRise,
    IntFall,
    IntRiseFall,
    
    // Alternate functions
    AltFn0,
    AltFn1,
    AltFn2,
    AltFn3,
    AltFn4,
    AltFn5,
    AltFn6,
    AltFn7,
    AltFn8,
    AltFn9,
    AltFn10,
    AltFn11,
    AltFn12,
    AltFn13,
    AltFn14,
    AltFn15,
};

enum class PortIndex { A, B, C, D, E, F, G, H, I };

struct GPIORegs {
    uint32_t MODER      = 0x00000000;
    uint32_t OTYPER     = 0x00000000;
    uint32_t OSPEEDR    = 0x00000000;
    uint32_t PUPDR      = 0x00000000;
    uint32_t ODR        = 0x00000000;
    uint32_t AFRL       = 0x00000000;
    uint32_t AFRH       = 0x00000000;
};

struct SYSCFGRegs {
    uint32_t EXTICR1    = 0x00000000;
    uint32_t EXTICR2    = 0x00000000;
    uint32_t EXTICR3    = 0x00000000;
    uint32_t EXTICR4    = 0x00000000;
};

struct EXTIRegs {
    uint32_t IMR        = 0x00000000;
    uint32_t EMR        = 0x00000000;
    uint32_t RTSR       = 0x00000000;
    uint32_t FTSR       = 0x00000000;
};

static constexpr GPIORegs GPIORegsDefaultPortA = {
    .MODER      = 0xA8000000,   // Nonzero
    .OTYPER     = 0x00000000,
    .OSPEEDR    = 0x0C000000,   // Nonzero
    .PUPDR      = 0x64000000,   // Nonzero
    .ODR        = 0x00000000,
    .AFRL       = 0x00000000,
    .AFRH       = 0x00000000,
};

static constexpr GPIORegs GPIORegsDefaultPortB = {
    .MODER      = 0x00000280,   // Nonzero
    .OTYPER     = 0x00000000,
    .OSPEEDR    = 0x000000C0,   // Nonzero
    .PUPDR      = 0x00000100,   // Nonzero
    .ODR        = 0x00000000,
    .AFRL       = 0x00000000,
    .AFRH       = 0x00000000,
};

template <PortIndex T_PortIdx>
class Port {
public:
    template <uint8_t T_PinIdx, Option... T_Opts>
    class Pin {
    public:
        static constexpr PortIndex PortIdx  = T_PortIdx;
        static constexpr uint8_t PinIdx     = T_PinIdx;
//        static constexpr uint16_t Bit       = UINT16_C(1)<<PinIdx;
        
        template <Option... T_NewOpts>
        using Opts = Port::Pin<PinIdx, T_NewOpts...>;
        
        // MARK: - GPIO Registers
        
        static constexpr uint32_t MODER() {
            if constexpr (_Getter(Option::Output0)) return 0x01<<(2*PinIdx);
            if constexpr (_Getter(Option::Output1)) return 0x01<<(2*PinIdx);
            if constexpr (_AltFnEn())               return 0x02<<(2*PinIdx);
            if constexpr (_Getter(Option::Analog))  return 0x03<<(2*PinIdx);
            return 0;
        }
        
        static constexpr uint32_t MODERMask() {
            return 0x03<<(2*PinIdx);
        }
        
        static constexpr uint32_t OTYPER() {
            if constexpr (_Getter(Option::OpenDrain)) return 1<<PinIdx;
            return 0;
        }
        
        static constexpr uint32_t OTYPERMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t OSPEEDR() {
            if constexpr (_Getter(Option::Speed1)) return 0x01<<(2*PinIdx);
            if constexpr (_Getter(Option::Speed2)) return 0x02<<(2*PinIdx);
            if constexpr (_Getter(Option::Speed3)) return 0x03<<(2*PinIdx);
            return 0;
        }
        
        static constexpr uint32_t OSPEEDRMask() {
            return 0x03<<(2*PinIdx);
        }
        
        static constexpr uint32_t PUPDR() {
            if constexpr (_Getter(Option::Resistor1)) return 0x01<<(2*PinIdx);
            if constexpr (_Getter(Option::Resistor0)) return 0x02<<(2*PinIdx);
            return 0;
        }
        
        static constexpr uint32_t PUPDRMask() {
            return 0x03<<(2*PinIdx);
        }
        
        static constexpr uint32_t ODR() {
            if constexpr (_Getter(Option::Output1)) return 1<<PinIdx;
            return 0;
        }
        
        static constexpr uint32_t ODRMask() {
            return 1<<PinIdx;
        }
        
        // Writing IDR doesn't make sense, so we don't supply this
//        static constexpr uint32_t IDR() {
//            return 0x00;
//        }
        
        static constexpr uint32_t IDRMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t BSRRSetMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t BSRRResetMask() {
            return 1<<(16 + PinIdx);
        }
        
        static constexpr uint32_t AFRL() {
            if constexpr (PinIdx < 8) return _AltFn()<<(4*PinIdx);
            return 0;
        }
        
        static constexpr uint32_t AFRLMask() {
            if constexpr (PinIdx < 8) return 0x0F<<(4*PinIdx);
            return 0;
        }
        
        static constexpr uint32_t AFRH() {
            if constexpr (PinIdx >= 8) return _AltFn()<<(4*(PinIdx-8));
            return 0;
        }
        
        static constexpr uint32_t AFRHMask() {
            if constexpr (PinIdx >= 8) return 0x0F<<(4*(PinIdx-8));
            return 0;
        }
        
        // MARK: - SYSCFG Registers
        static constexpr uint32_t EXTICR1() {
            if constexpr (_IntInterest() && (PinIdx/4) == 0) return ((uint32_t)PortIdx << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR1Mask() {
            if constexpr (_IntInterest() && (PinIdx/4) == 0) return (0x0F << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR2() {
            if constexpr (_IntInterest() && (PinIdx/4) == 1) return ((uint32_t)PortIdx << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
