toasterllc/MDCCode/Code/STM32/Shared/GPIO.h
        static constexpr uint32_t EXTICR2Mask() {
            if constexpr (_IntInterest() && (PinIdx/4) == 1) return (0x0F << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR3() {
            if constexpr (_IntInterest() && (PinIdx/4) == 2) return ((uint32_t)PortIdx << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR3Mask() {
            if constexpr (_IntInterest() && (PinIdx/4) == 2) return (0x0F << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR4() {
            if constexpr (_IntInterest() && (PinIdx/4) == 3) return ((uint32_t)PortIdx << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        static constexpr uint32_t EXTICR4Mask() {
            if constexpr (_IntInterest() && (PinIdx/4) == 3) return (0x0F << (4 * (PinIdx & 0x03)));
            return 0;
        }
        
        // MARK: - EXTI Registers
        
        static constexpr uint32_t IMR() {
            if constexpr (_Getter(Option::IntEn)) return 1<<PinIdx;
            return 0;
        }
        
        static constexpr uint32_t IMRMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t EMR() {
            // We don't support events yet (only interrupts)
            return 0;
        }
        
        static constexpr uint32_t EMRMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t RTSR() {
            if constexpr (_Getter(Option::IntRise))     return 1<<PinIdx;
            if constexpr (_Getter(Option::IntRiseFall)) return 1<<PinIdx;
            return 0;
        }
        
        static constexpr uint32_t RTSRMask() {
            return 1<<PinIdx;
        }
        
        static constexpr uint32_t FTSR() {
            if constexpr (_Getter(Option::IntFall))     return 1<<PinIdx;
            if constexpr (_Getter(Option::IntRiseFall)) return 1<<PinIdx;
            return 0;
        }
        
        static constexpr uint32_t FTSRMask() {
            return 1<<PinIdx;
        }
        
        // Init(): configure the pin
        static constexpr void Init() {
            // Set output value (ODR) before changing the mode (MODER), so we don't intermittently
            // drive the wrong value when going changing from input->output
            State::ODR(ODR());
            
            State::MODER(MODER());
            State::OTYPER(OTYPER());
            State::OSPEEDR(OSPEEDR());
            State::PUPDR(PUPDR());
            State::AFRL(AFRL());
            State::AFRH(AFRH());
            
            State::IMR(IMR());
            State::EMR(EMR());
            State::RTSR(RTSR());
            State::FTSR(FTSR());
        }
        
        // Init(): configure the pin, but only emit instructions for the changes relative to `T_Prev`
        template <typename T_Prev>
        static constexpr void Init() {
            // Set output value (ODR) before changing the mode (MODER), so we don't intermittently
            // drive the wrong value when going changing from input->output
            if constexpr (ODR() != T_Prev::ODR())
            State::ODR(ODR());
            
            if constexpr (MODER() != T_Prev::MODER())
            State::MODER(MODER());
            
            if constexpr (OTYPER() != T_Prev::OTYPER())
            State::OTYPER(OTYPER());
            
            if constexpr (OSPEEDR() != T_Prev::OSPEEDR())
            State::OSPEEDR(OSPEEDR());
            
            if constexpr (PUPDR() != T_Prev::PUPDR())
            State::PUPDR(PUPDR());
            
            if constexpr (AFRL() != T_Prev::AFRL())
            State::AFRL(AFRL());
            
            if constexpr (AFRH() != T_Prev::AFRH())
            State::AFRH(AFRH());
            
            if constexpr (IMR() != T_Prev::IMR())
            State::IMR(IMR());
            
            if constexpr (EMR() != T_Prev::EMR())
            State::EMR(EMR());
            
            if constexpr (RTSR() != T_Prev::RTSR())
            State::RTSR(RTSR());
            
            if constexpr (FTSR() != T_Prev::FTSR())
            State::FTSR(FTSR());
        }
        
        static bool Read() {
            return RegsRef().IDR & IDRMask();
        }
        
        static void Write(bool x) {
            if (x) RegsRef().BSRR |= BSRRSetMask();
            else   RegsRef().BSRR |= BSRRResetMask();
        }
        
        // State: accessors for reading/writing pin configuration at runtime
        struct State {
            // MARK: - GPIO Getters
            static constexpr uint32_t MODER() {
                return RegsRef().MODER & MODERMask();
            }
            
            static constexpr uint32_t OTYPER() {
                return RegsRef().OTYPER & OTYPERMask();
            }
            
            static constexpr uint32_t OSPEEDR() {
                return RegsRef().OSPEEDR & OSPEEDRMask();
            }
            
            static constexpr uint32_t PUPDR() {
                return RegsRef().PUPDR & PUPDRMask();
            }
            
            static constexpr uint32_t ODR() {
                return RegsRef().ODR & ODRMask();
            }
            
            static constexpr uint32_t IDR() {
                return RegsRef().IDR & IDRMask();
            }
            
            static constexpr uint32_t AFRL() {
                return RegsRef().AFR[0] & AFRLMask();
            }
            
            static constexpr uint32_t AFRH() {
                return RegsRef().AFR[1] & AFRHMask();
            }
            
            // MARK: - GPIO Setters
            static constexpr void MODER(uint32_t x) {
                RegsRef().MODER = (RegsRef().MODER & ~MODERMask()) | x;
            }
            
            static constexpr void OTYPER(uint32_t x) {
                RegsRef().OTYPER = (RegsRef().OTYPER & ~OTYPERMask()) | x;
            }
            
            static constexpr void OSPEEDR(uint32_t x) {
                RegsRef().OSPEEDR = (RegsRef().OSPEEDR & ~OSPEEDRMask()) | x;
            }
            
            static constexpr void PUPDR(uint32_t x) {
                RegsRef().PUPDR = (RegsRef().PUPDR & ~PUPDRMask()) | x;
            }
            
            static constexpr void ODR(uint32_t x) {
                RegsRef().ODR = (RegsRef().ODR & ~ODRMask()) | x;
            }
            
