toasterllc/MDCCode/Code/STM32/Shared/GPIO.h
            // Writing IDR doesn't make sense, so we don't supply this
//            static constexpr void IDR(uint32_t x) {
//                RegsRef().IDR = (RegsRef().IDR & ~IDRMask()) | x;
//            }
            
            static constexpr void AFRL(uint32_t x) {
                RegsRef().AFR[0] = (RegsRef().AFR[0] & ~AFRLMask()) | x;
            }
            
            static constexpr void AFRH(uint32_t x) {
                RegsRef().AFR[1] = (RegsRef().AFR[1] & ~AFRHMask()) | x;
            }
            
            // MARK: - EXTI Getters
            static constexpr uint32_t IMR() {
                return EXTI->IMR & IMRMask();
            }
            
            static constexpr uint32_t EMR() {
                return EXTI->EMR & EMRMask();
            }
            
            static constexpr uint32_t RTSR() {
                return EXTI->RTSR & RTSRMask();
            }
            
            static constexpr uint32_t FTSR() {
                return EXTI->FTSR & FTSRMask();
            }
            
            // MARK: - EXTI Setters
            static constexpr void IMR(uint32_t x) {
                EXTI->IMR = (EXTI->IMR & ~IMRMask()) | x;
            }
            
            static constexpr void EMR(uint32_t x) {
                EXTI->EMR = (EXTI->EMR & ~EMRMask()) | x;
            }
            
            static constexpr void RTSR(uint32_t x) {
                EXTI->RTSR = (EXTI->RTSR & ~RTSRMask()) | x;
            }
            
            static constexpr void FTSR(uint32_t x) {
                EXTI->FTSR = (EXTI->FTSR & ~FTSRMask()) | x;
            }
            
            // MARK: - Other Functions
            static bool IntClear() {
                if (!(EXTI->PR & (1<<PinIdx))) return false;
                // Clear interrupt
                EXTI->PR = (1<<PinIdx);
                return true;
            }
        };
        
    private:
        static constexpr bool _AltFnEn() {
            if constexpr (_Getter(Option::AltFn0))  return true;
            if constexpr (_Getter(Option::AltFn1))  return true;
            if constexpr (_Getter(Option::AltFn2))  return true;
            if constexpr (_Getter(Option::AltFn3))  return true;
            if constexpr (_Getter(Option::AltFn4))  return true;
            if constexpr (_Getter(Option::AltFn5))  return true;
            if constexpr (_Getter(Option::AltFn6))  return true;
            if constexpr (_Getter(Option::AltFn7))  return true;
            if constexpr (_Getter(Option::AltFn8))  return true;
            if constexpr (_Getter(Option::AltFn9))  return true;
            if constexpr (_Getter(Option::AltFn10)) return true;
            if constexpr (_Getter(Option::AltFn11)) return true;
            if constexpr (_Getter(Option::AltFn12)) return true;
            if constexpr (_Getter(Option::AltFn13)) return true;
            if constexpr (_Getter(Option::AltFn14)) return true;
            if constexpr (_Getter(Option::AltFn15)) return true;
            return false;
        }
        
        static constexpr uint32_t _AltFn() {
            if constexpr (_Getter(Option::AltFn0))  return 0x00;
            if constexpr (_Getter(Option::AltFn1))  return 0x01;
            if constexpr (_Getter(Option::AltFn2))  return 0x02;
            if constexpr (_Getter(Option::AltFn3))  return 0x03;
            if constexpr (_Getter(Option::AltFn4))  return 0x04;
            if constexpr (_Getter(Option::AltFn5))  return 0x05;
            if constexpr (_Getter(Option::AltFn6))  return 0x06;
            if constexpr (_Getter(Option::AltFn7))  return 0x07;
            if constexpr (_Getter(Option::AltFn8))  return 0x08;
            if constexpr (_Getter(Option::AltFn9))  return 0x09;
            if constexpr (_Getter(Option::AltFn10)) return 0x0A;
            if constexpr (_Getter(Option::AltFn11)) return 0x0B;
            if constexpr (_Getter(Option::AltFn12)) return 0x0C;
            if constexpr (_Getter(Option::AltFn13)) return 0x0D;
            if constexpr (_Getter(Option::AltFn14)) return 0x0E;
            if constexpr (_Getter(Option::AltFn15)) return 0x0F;
            return 0;
        }
        
        // _IntInterest(): whether the pin is 'interested' in an interrupt edge,
        // (but the interrupt is not necessarily enabled)
        static constexpr bool _IntInterest() {
            if constexpr (_Getter(Option::IntRise))     return true;
            if constexpr (_Getter(Option::IntFall))     return true;
            if constexpr (_Getter(Option::IntRiseFall)) return true;
            return false;
        }
        
        static constexpr bool _Getter(Option opt) {
            for (const Option o : (Option[]){T_Opts...}) {
                if (o == opt) return true;
            }
            return false;
        }
    };
    
    static constexpr GPIO_TypeDef& RegsRef() {
        if constexpr (T_PortIdx == PortIndex::A) return *GPIOA;
        if constexpr (T_PortIdx == PortIndex::B) return *GPIOB;
        if constexpr (T_PortIdx == PortIndex::C) return *GPIOC;
        if constexpr (T_PortIdx == PortIndex::D) return *GPIOD;
        if constexpr (T_PortIdx == PortIndex::E) return *GPIOE;
        if constexpr (T_PortIdx == PortIndex::F) return *GPIOF;
        if constexpr (T_PortIdx == PortIndex::G) return *GPIOG;
        if constexpr (T_PortIdx == PortIndex::H) return *GPIOH;
        if constexpr (T_PortIdx == PortIndex::I) return *GPIOI;
    }
};

template <typename T_Port>
static void GPIORegsSet(const GPIORegs& x) {
    GPIO_TypeDef& r = T_Port::RegsRef();
    
    // Set output value (ODR) before changing the mode (MODER), so we don't intermittently
    // drive the wrong value when going changing from input->output
    r.ODR     = x.ODR;
    
    r.MODER   = x.MODER;
    r.OTYPER  = x.OTYPER;
    r.OSPEEDR = x.OSPEEDR;
    r.PUPDR   = x.PUPDR;
    r.AFR[0]  = x.AFRL;
    r.AFR[1]  = x.AFRH;
}

static void SYSCFGRegsSet(const SYSCFGRegs& x) {
    SYSCFG->EXTICR[1-1] = x.EXTICR1;
    SYSCFG->EXTICR[2-1] = x.EXTICR2;
    SYSCFG->EXTICR[3-1] = x.EXTICR3;
    SYSCFG->EXTICR[4-1] = x.EXTICR4;
}

