toasterllc/MDCCode/Code/STM32/Shared/GPIO.h
static void EXTIRegsSet(const EXTIRegs& x) {
    EXTI->IMR  = x.IMR;
    EXTI->EMR  = x.EMR;
    EXTI->RTSR = x.RTSR;
    EXTI->FTSR = x.FTSR;
}





template <PortIndex T_PortIdx>
static constexpr GPIORegs _GPIORegsCollect(GPIORegs r) {
    return r;
}

template <PortIndex T_PortIdx, typename T_Pin, typename... T_Pins>
static constexpr GPIORegs _GPIORegsCollect(GPIORegs r) {
    // Only consider pins for the specified port index (T_PortIdx)
    if constexpr (T_Pin::PortIdx == T_PortIdx) {
        r.MODER   &= ~T_Pin::MODERMask();
        r.OTYPER  &= ~T_Pin::OTYPERMask();
        r.OSPEEDR &= ~T_Pin::OSPEEDRMask();
        r.PUPDR   &= ~T_Pin::PUPDRMask();
        r.ODR     &= ~T_Pin::ODRMask();
        r.AFRL    &= ~T_Pin::AFRLMask();
        r.AFRH    &= ~T_Pin::AFRHMask();
        
        r.MODER   |=  T_Pin::MODER();
        r.OTYPER  |=  T_Pin::OTYPER();
        r.OSPEEDR |=  T_Pin::OSPEEDR();
        r.PUPDR   |=  T_Pin::PUPDR();
        r.ODR     |=  T_Pin::ODR();
        r.AFRL    |=  T_Pin::AFRL();
        r.AFRH    |=  T_Pin::AFRH();
    }
    
    if constexpr (sizeof...(T_Pins)) return _GPIORegsCollect<T_PortIdx, T_Pins...>(r);
    else return r;
}








template <PortIndex T_PortIdx>
static constexpr size_t _GPIORegsCountPort(size_t r) {
    return r;
}

template <PortIndex T_PortIdx, typename T_Pin, typename... T_Pins>
static constexpr size_t _GPIORegsCountPort(size_t r) {
    // Only consider pins for the specified port index (T_PortIdx)
    if constexpr (T_Pin::PortIdx == T_PortIdx) {
        r += 1;
    }
    
    if constexpr (sizeof...(T_Pins)) return _GPIORegsCountPort<T_PortIdx, T_Pins...>(r);
    else return r;
}







static constexpr SYSCFGRegs _SYSCFGRegsCollect(SYSCFGRegs r) {
    return r;
}

template <typename T_Pin, typename... T_Pins>
static constexpr SYSCFGRegs _SYSCFGRegsCollect(SYSCFGRegs r) {
    r.EXTICR1 &= ~T_Pin::EXTICR1Mask();
    r.EXTICR2 &= ~T_Pin::EXTICR2Mask();
    r.EXTICR3 &= ~T_Pin::EXTICR3Mask();
    r.EXTICR4 &= ~T_Pin::EXTICR4Mask();
    
    r.EXTICR1 |=  T_Pin::EXTICR1();
    r.EXTICR2 |=  T_Pin::EXTICR2();
    r.EXTICR3 |=  T_Pin::EXTICR3();
    r.EXTICR4 |=  T_Pin::EXTICR4();
    
    if constexpr (sizeof...(T_Pins)) return _SYSCFGRegsCollect<T_Pins...>(r);
    else return r;
}






static constexpr EXTIRegs _EXTIRegsCollect(EXTIRegs r) {
    return r;
}

template <typename T_Pin, typename... T_Pins>
static constexpr EXTIRegs _EXTIRegsCollect(EXTIRegs r) {
    r.IMR  &= ~T_Pin::IMRMask();
    r.EMR  &= ~T_Pin::EMRMask();
    r.RTSR &= ~T_Pin::RTSRMask();
    r.FTSR &= ~T_Pin::FTSRMask();
    
    r.IMR  |=  T_Pin::IMR();
    r.EMR  |=  T_Pin::EMR();
    r.RTSR |=  T_Pin::RTSR();
    r.FTSR |=  T_Pin::FTSR();
    
    if constexpr (sizeof...(T_Pins)) return _EXTIRegsCollect<T_Pins...>(r);
    else return r;
}






using PortA = Port<PortIndex::A>;
using PortB = Port<PortIndex::B>;
using PortC = Port<PortIndex::C>;
using PortD = Port<PortIndex::D>;
using PortE = Port<PortIndex::E>;
using PortF = Port<PortIndex::F>;
using PortG = Port<PortIndex::G>;
using PortH = Port<PortIndex::H>;
using PortI = Port<PortIndex::I>;

template <typename... T_Pins>
static void Init() {
    // Disable interrupts
    Toastbox::IntState ints(false);
    
    // Enable GPIO clocks
    if (_GPIORegsCountPort<PortIndex::A, T_Pins...>(0)) __HAL_RCC_GPIOA_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::B, T_Pins...>(0)) __HAL_RCC_GPIOB_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::C, T_Pins...>(0)) __HAL_RCC_GPIOC_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::D, T_Pins...>(0)) __HAL_RCC_GPIOD_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::E, T_Pins...>(0)) __HAL_RCC_GPIOE_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::F, T_Pins...>(0)) __HAL_RCC_GPIOF_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::G, T_Pins...>(0)) __HAL_RCC_GPIOG_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::H, T_Pins...>(0)) __HAL_RCC_GPIOH_CLK_ENABLE();
    if (_GPIORegsCountPort<PortIndex::I, T_Pins...>(0)) __HAL_RCC_GPIOI_CLK_ENABLE();
    
    // Enable SYSCFG clock
    // We unconditionally enable the SYSCFG clock because it's used for EXTI interrupts
    // that may be enable after our initial GPIO configuration.
    __HAL_RCC_SYSCFG_CLK_ENABLE();
    
    // Config GPIO registers
    GPIORegsSet<PortA>(_GPIORegsCollect<PortIndex::A, T_Pins...>(GPIORegsDefaultPortA));
    GPIORegsSet<PortB>(_GPIORegsCollect<PortIndex::B, T_Pins...>(GPIORegsDefaultPortB));
    GPIORegsSet<PortC>(_GPIORegsCollect<PortIndex::C, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortD>(_GPIORegsCollect<PortIndex::D, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortE>(_GPIORegsCollect<PortIndex::E, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortF>(_GPIORegsCollect<PortIndex::F, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortG>(_GPIORegsCollect<PortIndex::G, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortH>(_GPIORegsCollect<PortIndex::H, T_Pins...>(GPIORegs{}));
    GPIORegsSet<PortI>(_GPIORegsCollect<PortIndex::I, T_Pins...>(GPIORegs{}));
    
    // Config SYSCFG registers
    SYSCFGRegsSet(_SYSCFGRegsCollect<T_Pins...>(SYSCFGRegs{}));
    
    // Config EXTI registers
    EXTIRegsSet(_EXTIRegsCollect<T_Pins...>(EXTIRegs{}));
}

} // namespace GPIO
